TOKEN = '6084674199:AAGpTNLqjR-CQgrQZQzPpr9V8pS3iEo-eDg'
PAYMENTS_TOKEN = '381764678:TEST:58845'
PONI_BOT = 'GPT-Dialog' 

p = '5630295382:AAGvQTb4UIAVYh6_t_7ijKI4Q799b1_e0CI'
OPENAIKEY = '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'

DAYS_ADD_TO_PAYMENT = 30
DAYS_ADD_FOR_REFFERAL = 5
DAYS_FREE_USE = 1
DAYS_FREE_REFFERAL = 1

TEXT_START = '''Привет! Я – GPT-Dialog, языковая модель ИИ на базе ChatGPT, которая здесь, чтобы помочь. Просто спроси, что тебя интересует.'''

TEXT_INSTRUCTION = '''Работать со мной просто. Все, что вам нужно сделать, это ввести свои вопросы или подсказки, и я сгенерирую ответ на основе информации, на которой меня учили. Вот несколько советов для эффективного взаимодействия:
- Используйте кнопку /newtopic для того, чтобы начать новый разговор, не относящийся контекстом к предыдущему.
- Будьте ясны: формулируйте свои вопросы или подсказки четко и лаконично. Это помогает мне лучше понять ваши потребности и дать более точные ответы.
- Предоставьте контекст: при необходимости предоставьте соответствующий контекст или справочную информацию, чтобы помочь мне лучше понять тему или ситуацию, о которой вы говорите. Чем больше подробностей вы предоставите, тем более индивидуальными и полезными могут быть мои ответы.
- Задавайте уточняющие вопросы. Не стесняйтесь задавать уточняющие вопросы или запрашивать разъяснения, если это необходимо. Я здесь, чтобы помочь вам, поэтому не стесняйтесь вступать со мной в разговор.
- Будьте вежливее: не забывайте поддерживать уважительный и вежливый тон во время нашего взаимодействия. Хотя я - искусственный интеллект, я ценю доброе и вежливое общение.
- Есть ограничения в знаниях: хоть я и стараюсь предоставлять полезную и точную информацию, имейте в виду, что я не всегда могу иметь доступ к самой последней информации, и мои ответы не следует рассматривать как профессиональный совет.
Помните, я здесь, чтобы помочь вам и предоставить информацию в меру своих возможностей. Просто введите ваши запросы, и я сделаю все возможное, чтобы помочь вам!'''

TEXT_ABOUT = '''Как искусственный интеллект, я стараюсь помогать людям разными способами. Я могу предоставлять информацию по широкому кругу тем, отвечать на вопросы, предлагать предложения и участвовать в беседах. Если кому-то нужна помощь в решении сложной проблемы, он ищет совета по определенному вопросу или просто желает дружеского разговора, я здесь, чтобы протянуть руку помощи.
Я стремлюсь предоставлять точную и полезную информацию, способствуя обучению и обмену знаниями. Однако важно отметить, что, хотя я могу генерировать ответы на основе шаблонов данных, на которых меня обучали, я не обладаю личным опытом, эмоциями или сознанием. Моя цель — давать полезные и информативные ответы на основе данных, на которых меня учили, но меня всегда следует использовать как инструмент для расширения человеческих возможностей, а не как замену профессионального совета или критического мышления.
Таким образом, я являюсь языковой моделью ИИ, созданной для того, чтобы помогать и предоставлять информацию в меру своих возможностей. Моя цель — помогать людям, генерируя актуальные и ценные ответы, облегчая беседы и поддерживая пользователей в их начинаниях.'''

TEXT_REFERRAL = '''Реферальная программа: заработайте дополнительные дни бесплатного использования бота Telegram на основе подписки
Мы рады представить нашу реферальную программу, предназначенную для вознаграждения наших уважаемых пользователей за распространение информации о нашем боте на основе подписки. Благодаря нашей реферальной программе у вас есть возможность продлить бесплатное использование бота, пригласив своих друзей, а также дав им дополнительный стимул присоединиться.
Вот как работает реферальная программа:
Период тестирования: когда вы впервые начнете использовать нашего бота, у вас будет один день, чтобы бесплатно изучить его возможности и функции. Это позволит вам ознакомиться с тем, что может предложить наш бот, прежде чем принять решение о подписке.
Приглашение рефералов: после того, как вы попробуете бота и, если будете удовлетворены его возможностями, вы можете пригласить своих друзей и знакомых присоединиться. Поделитесь своей уникальной реферальной ссылкой в графе /Myprofile
Бесплатное использование для вас: если ваш приглашенный друг решит подписаться и заплатит за месяц подписки бота, вы получите автоматическое продление на 5 дней бесплатного использования в дополнение к вашей существующей подписке. Это наш способ отблагодарить вас за рекомендацию нашего бота другим.
Выгода для приглашенных рефералов: не только вы получаете выгоду от успешных рефералов, но и ваши приглашенные друзья! Они получат скидку на первый месяц использования в размере 10%!
Наслаждайтесь постоянными преимуществами: по мере того, как вы набираете успешных рефералов, вы можете наслаждаться расширенным периодом бесплатного использования бота.
Мы считаем, что наша реферальная программа обеспечивает беспроигрышную ситуацию как для вас, так и для ваших приглашенных друзей. Это позволяет вам продлить бесплатное использование бота, в то время как ваши друзья получают скидку при оплате.
Спасибо за то, что являетесь частью нашего сообщества и помогаете нам расти. Мы ценим вашу поддержку и надеемся, что наш бот будет полезен и ценен в вашей повседневной деятельности. Если у вас есть дополнительные вопросы или вам нужна помощь, не стесняйтесь обращаться в нашу службу поддержки: ______________ (сюда пропишем юзера в Телеграм, надо создать аккаунт отдельный)'''