from aiogram.utils.markdown import hbold, hunderline, hcode, hlink

TEXT_START = '''Привет! Я – GPT-Dialog, языковая модель ИИ на базе ChatGPT, которая здесь, чтобы помочь. Просто спроси, что тебя интересует.'''

TEXT_LINK = 'http://a0835272.xsph.ru'

TEXT_LINK2 = "https://poni03.github.io"

TEXT_LINK3 = "https://t.me/Help_GPT_Dialog"

TEXT_INSTRUCTION = f'''В этом разделе приведены инструкции по эффективному использованию нашего бота, работающего на основе ChatGPT.\n
{hlink('Возможности GPT Dialog', TEXT_LINK)} - Здесь вы получите представление об огромных возможностях этого ИИ-бота.\n
{hlink('Рекомендации по отправке запросов в диалоговое окно бота', TEXT_LINK2)}\nВ этом сегменте приведены  рекомендации по составлению хорошо структурированного запроса к боту для получения точных ответов.\n
Написать в {hlink('техподдержку', TEXT_LINK3)} бота Мы постараемся ответить Вам как можно быстрее'''

TEXT_REFERRAL = '''Реферальная программа: заработайте дополнительные дни бесплатного использования бота Telegram на основе подписки
Мы рады представить нашу реферальную программу, предназначенную для вознаграждения наших уважаемых пользователей за распространение информации о нашем боте на основе подписки. Благодаря нашей реферальной программе у вас есть возможность продлить бесплатное использование бота, пригласив своих друзей, а также дав им дополнительный стимул присоединиться.
Вот как работает реферальная программа:
Период тестирования: когда вы впервые начнете использовать нашего бота, у вас будет один день, чтобы бесплатно изучить его возможности и функции. Это позволит вам ознакомиться с тем, что может предложить наш бот, прежде чем принять решение о подписке.
Приглашение рефералов: после того, как вы попробуете бота и, если будете удовлетворены его возможностями, вы можете пригласить своих друзей и знакомых присоединиться. Поделитесь своей уникальной реферальной ссылкой в графе /Myprofile
Бесплатное использование для вас: если ваш приглашенный друг решит подписаться и заплатит за месяц подписки бота, вы получите автоматическое продление на 5 дней бесплатного использования в дополнение к вашей существующей подписке. Это наш способ отблагодарить вас за рекомендацию нашего бота другим.
Выгода для приглашенных рефералов: не только вы получаете выгоду от успешных рефералов, но и ваши приглашенные друзья! Они получат скидку на первый месяц использования в размере 10%!
Наслаждайтесь постоянными преимуществами: по мере того, как вы набираете успешных рефералов, вы можете наслаждаться расширенным периодом бесплатного использования бота.
Мы считаем, что наша реферальная программа обеспечивает беспроигрышную ситуацию как для вас, так и для ваших приглашенных друзей. Это позволяет вам продлить бесплатное использование бота, в то время как ваши друзья получают скидку при оплате.
Спасибо за то, что являетесь частью нашего сообщества и помогаете нам расти. Мы ценим вашу поддержку и надеемся, что наш бот будет полезен и ценен в вашей повседневной деятельности. Если у вас есть дополнительные вопросы или вам нужна помощь, не стесняйтесь обращаться в нашу службу поддержки: https://t.me/Help_GPT_Dialog'''

REMINDER = '''Привет!
Мы заметили, что ты давно не пользовался нашим ботом GPT_Dialog_bot.
Мы скучаем по тебе!
Мы хотим напомнить тебе о том, что наш бот умеет многое.

Например, он может:
Генерировать текст, переводить с другого языка, писать разные виды креативного контента.
Отвечать на твои вопросы, даже если они очень сложные
Помогать тебе в учебе, работе или творчестве.
Мы всегда будем рады тебе помочь.

Твой GPT_Dialog_bot.'''
